export const mockContact = {
  member_number: "000001",
  member_name: "นายทดสอบ ระบบ",
  member_unit: "00005 สหกรณ์",
  date: "31 สิงหาคม 2568",
  contacts: [
    {
      con_key: "จำนวนหุุ้น",
      con_name: "30,000 หุ้น",
      con_total: "เป็นเงิน 300,000.00 บาท",
    },
    {
      con_key: "เงินกู้สามัญ",
      con_name: "สัญญาเลขที่ สน67001256",
      con_total: "เงินต้นคงเหลือ 500,000.00 บาท",
    },
    {
      con_key: "งินกู้ฉุกเฉิน",
      con_name: "สัญญาเลขที่ ฉฉ67001122",
      con_total: "เงินต้นคงเหลือ 50,000.00 บาท",
    },
    {
      con_key: "เงินฝากออมทรัพย์พิเศษ",
      con_name: "เลขที่บัญชี 0012001499 ชื่อบัญชี นายทดสอบ ระบบ",
      con_total: "เงินฝากคงเหลือ 200,000.00 บาท",
    },
    {
      con_key: "เงินฝากออมทรัพย์พิเศษ",
      con_name: "เลขที่บัญชี 0012002105 ชื่อบัญชี นายทดสอบ ระบบ",
      con_total: "เงินฝากคงเหลือ 100,000.00 บาท",
    },
  ],
};
