import { Metadata } from "next";
import Image from "next/image";

export const metadata: Metadata = {
  title: "เกี่ยวกับสหกรณ์",
};

export default function page() {
  return (
    <div className="wrapper space-y-10">
      <div className="max-w-5xl mx-auto space-y-10">
        <h1 className="text-Medium-grey text-3xl font-normal text-center">
          เกี่ยวกับสหกรณ์
        </h1>
        <p className="text-stone-500 text-xl font-bold leading-9">
          กรมประชาสงเคราะห์ได้เล็งเห็นความสำคัญในเรื่องสวัสดิการด้านต่างๆ
          ของข้าราชการ เช่นในเรื่องความเป็นอยู่เรื่องที่อยู่อาศัย
          เรื่องการศึกษาของบุตร เป็นต้น ซึ่งแต่ละด้าน ก็ได้ดำเนินการไปแล้วด้วยดี
          สำหรับในด้านการออมทรัพย์เคยได้จัดตั้งทุนหนึ่ง เรียกว่า “ทุนกลาง”
          เมื่อราวปี พ.ศ.2495 โดยรวบรวมเงินไว้ก้อนหนึ่งเรียกเก็บ
          โดยความสมัครใจจากข้าราชการที่ได้รับเงินเดือนขึ้น
          หรือเงินตกเบิกแต่ละปี แล้วสมทบเข้ากองทุนนี้
          เมื่อผู้ใดมีความเดือดร้อนต้องการใช้เงิน ก็ขอยืมจากทุนกลางนี้ได้ 
          นี่เป็นการเริ่มต้นขั้นแรกของการออมทรัพย์ของกรมประชาสงเคราะห์
        </p>
        <div className="grid md:grid-cols-3 gap-5 md:gap-0">
          <div className="image flex flex-col items-center md:items-start gap-2.5">
            <Image
              src="/images/about-us-1.png"
              alt="about 1 image"
              width={500}
              height={500}
              className="w-auto h-52 object-cover"
            />
            <p className=" text-stone-500 text-sm md:ml-4">
              นายปกรณ์ อังศุสิงห์
            </p>
          </div>
          <div className="content md:col-span-2 md:-ml-32 text-stone-500 text-lg space-y-10 leading-8">
            <p>
              ต่อมาในวันที่ 28 กันยายน พ.ศ.2504
              โดยการริเริ่มของข้าราชการชั้นผู้ใหญ่ได้ประชุมผู้เข้าชื่อ
              เพื่อขอตั้งเป็นสหกรณ์ออมทรัพย์และขอจดทะเบียนตามพระราชบัญญัติสหกรณ์
              พ.ศ.2471 เมื่อวันที่ 25 ตุลาคม พ.ศ.2504 โดยใช้ชื่อว่า{" "}
              <span className=" font-bold">
                “สหกรณ์ออมทรัพย์ข้าราชการประชาสงเคราะห์จำกัดสินใช้”
              </span>{" "}
              และได้เริ่มประกอบธุรกิจเป็นครั้งแรก เมื่อวันที่ 31 ตุลาคม พ.ศ.2504
              โดยมี นายปกรณ์ อังศุสิงห์ อธิบดีกรมประชาสงเคราะห์ ในสมัยนั้น
              เป็นประธานกรรมการดำเนินการคนแรกของสหกรณ์
              มีสมาชิกขณะขอจดทะเบียนเพียง 121 คน
            </p>
            <p>
              ซึ่งในปีต่อๆ มาสหกรณ์ฯ
              ก็ค่อยเติบโตมีจำนวนสมาชิกจำนวนหุ้นทุนดำเนินการ
              และกำไรสุทธิเพิ่มมากขึ้นตามลำดับ
              ดังรายละเอียดในรายการแสดงฐานะของสหกรณ์ ในปีต่างๆ
              ตั้งแต่เริ่มต้นจนถึงบัดนี้ซึ่งได้รวบรวมไว้
              ในเรื่องข้อมูลที่น่าสนใจแล้ว
            </p>
          </div>
        </div>
        <p className="text-stone-500 text-lg leading-8">
          จะเห็นได้ว่า สหกรณ์ฯ
          ได้เริ่มจากสมาชิกเพียงร้อยกว่าคนมีกำไรสุทธิในปีแรกไม่ถึงห้าร้อยบาทในการบริหารสหกรณ์ฯ
          มีคณะกรรมการซึ่งได้รับการเลือกตั้งจากสมาชิกแต่ละปี
          โดยมีผู้แทนจากกองต่างๆ ผลัดเปลี่ยนหมุนเวียนร่วมอยู่ในคณะ
          เพื่อทำหน้าที่ดูแลและควบคุมให้การดำเนินงานเป็นไปด้วยความเรียบร้อย
        </p>
        <p className="text-stone-500 text-lg leading-8">
          ได้จัดตั้งคณะกรรมการเงินกู้
          เพื่อพิจารณาการขอกู้สามัญและกู้พิเศษของสมาชิกกับได้ออกระเบียบต่างๆ
          ขึ้น เพื่อใช้ในการปฏิบัติและแบ่งรูปงานของสหกรณ์ ออกเป็น 2 ฝ่าย คือ
          ฝ่ายเลขานุการสำนักงาน และ เลขานุการกรม
        </p>
        <div className="grid md:grid-cols-3 gap-10">
          <div className="content md:col-span-2 text-stone-500 text-lg space-y-10 leading-8">
            <p>
              ต่อมาองการเจ้าหน้าที่เป็นเจ้าหน้าที่เกี่ยวกับงานธุรการทั่วไป
              ฝ่ายเหรัญญิกกองคลังเป็น เจ้าหน้าที่เกี่ยวกับการเงินและการบัญชี
              โดยใช้ข้าราชการของกองนั้นๆ เป็นเจ้าหน้าที่ และจ้างบุคคลภายนอก
              บางส่วนเป็นผู้ช่วยเหลือ ใช้สถานที่ของกองเป็นที่ติดต่อกับสมาชิก
              การดำเนินงานได้เจริญก้าวหน้ามาตามลำดับ
            </p>
            <p>
              ฉะนั้นในปลายปี พ.ศ.2518 ในสมัย นายอร่าม สุทธะพินทุ
              เป็นอธิบดีกรมประชาสงเคราะห์และเป็นประธานกรรมการ ได้เห็นว่าสหกรณ์ฯ
              มีจำนวนสมาชิกเพิ่มมากขึ้นทุกปี มีรายได้สูงขึ้น
              และมีทุนดำเนินการร่วม 11 ล้านบาท พอจะเลี้ยงตัวเองได้
              จึงได้ปรับปรุงงานสหกรณ์ฯ เสียใหม่ แยกมาจัดตั้งเป็นสำนักงาน
              โดยเอกเทศ จัดจ้างเจ้าหน้าที่และจัดซื้ออุปกรณ์ต่างๆ ในการดำเนินงาน
              โดยใช้เงินของสหกรณ์ฯ เองตามกำลังงบประมาณ
              มีผู้จัดการเป็นผู้รับผิดชอบในบรรดากิจการต่างๆ
              ตลอดจนควบคุมดูแลการปฏิบัติงาน
            </p>
          </div>
          <div className="image space-y-2.5">
            <Image
              src="/images/about-us-2.png"
              alt="about 2 image"
              width={500}
              height={500}
              className="w-auto h-80"
            />
            <p className=" text-stone-500 text-sm text-center">
              นายอร่าม สุทธะพินทุ
            </p>
          </div>
        </div>
      </div>
      <div className="w-full flex flex-col items-center justify-center gap-5 h-72 px-12 py-5 md:h-56 md:px-0 md:py-0 bg-gradient-to-b from-sky-500 to-blue-600 rounded-[20px]">
        <h3 className="text-white text-xl font-bold">วิสัยทัศน์</h3>
        <h5 className="text-white text-2xl font-bold text-center leading-9">
          เป็นสหกรณ์ที่มีการบริหารจัดการด้วยหลักธรรมาภิบาล
          เพื่อส่งเสริมคุณภาพชีวิตของสมาชิกอย่างยั่งยืน
        </h5>
      </div>
      <div className="max-w-5xl mx-auto space-y-10">
        <div className="grid md:grid-cols-2 gap-10">
          <div className="space-y-5">
            <h3 className="Main-dark-Blue text-xl font-bold">พันรกิจ</h3>
            <ul className="list-decimal leading-9 text-stone-500 text-lg ml-5">
              <li>
                ส่งเสริมการออม การลงทุน จัดบริการเงินกู้
                พัฒนาประสิทธิภาพการให้บริการ และจัดสวัสดิการแก่สมาชิก
              </li>
              <li>เสริมสร้างความเข้มแข็งให้องค์กรโดยหลักธรรมาภิบาล</li>
              <li>พัฒนาบุคลากร เพื่อการปฏิบัติงานที่มีประสิทธิภาพ</li>
              <li>พัฒนาระบบข้อมูลสารสนเทศและการประชาสัมพันธ์</li>
            </ul>
          </div>
          <div className="space-y-5">
            <h3 className="Main-dark-Blue text-xl font-bold">เป้าประสงค์</h3>
            <ul className="list-decimal leading-9 text-stone-500 text-lg ml-5">
              <li>
                มีบริการที่ดี รวดเร็วและตอบสนองความต้องการ ของสมาชิก
                รวมทั้งมีการจัดสวัสดิการให้แก่สมาชิก หลากหลายและทั่วถึง
              </li>
              <li>
                องค์กรมีความเข้มแข็งในการบริหารจัดการที่มีประสิทธิภาพ
                ได้รับความเชื่อมั่นจากสมาชิกและผู้เกี่ยวข้อง
              </li>
              <li>บุคลากรมีศักยภาพในการให้บริการที่มีจิตมุ่งบริการ</li>
              <li>
                มีระบบเทคโนโลยีสารสนเทศและการประชาสัมพันธ์
                ที่เอื้อต่อการปฏิบัติงานอย่างมีประสิทธิภาพ
              </li>
            </ul>
          </div>
        </div>
        <div className="space-y-5">
          <h3 className="Main-dark-Blue text-xl font-bold">วัตถุประสงค์</h3>
          <ul className="list-decimal leading-9 text-stone-500 text-lg ml-5">
            <li>
              ส่งเสริมให้สมาชิกออมทรัพย์
              โดยช่วยให้สามารถสงวนส่วนแห่งรายได้ของตนไว้ในทาง
              อันมั่นคงและได้รับประโยชน์ตามสมควร
            </li>
            <li>ส่งเสริมการช่วยตัวเองและช่วยเหลือซึ่งกันและกันในหมู่สมาชิก</li>
            <li>รับฝากเงินจากสมาชิกหรือสหกรณ์อื่น</li>
            <li>จัดหาทุนเพื่อกิจการตามวัตุประสงค์ของสหกรณ์</li>
            <li>ให้เงินกู้แก่สมาชิก</li>
            <li>ให้สหกรณ์อื่นกู้ยืมเงิน</li>
            <li>
              ซื้อหุ้นของธนาคารซึ่งมีวัตถุประสงค์เพื่อให้ความช่วยเหลือทางการเงินแก่สหกรณ์
            </li>
            <li>ซื้อหุ้นของชุมนุมสหกรณ์หรือสหกรณ์อื่น</li>
            <li>
              ซื้อหุ้นของสถาบันที่ประกอบธุรกิจอันทำให้เกิดความสะดวกหรือส่งเสริมความเจริญแก่กิจการของสหกรณ์
            </li>
            <li>ซื้อหลักทรัพย์รัฐบาลหรือรัฐวิสาหกิจ</li>
            <li>ออกตั๋วสัญญาใช้เงินและตราสารการเงิน</li>
            <li>
              ฝากหรือลงทุนอย่างอื่นตามกฎหมายและตามที่คณะกรรมการการพัฒนาการสหกรณ์แห่งชาติกำหนด
            </li>
            <li>ดำเนินการให้กู้ยืมเพื่อการเคหะ</li>
            <li>ให้สวัสดิการและการสงเคราะห์ตามสมควรแก่สมาชิกและครอบครัว</li>
            <li>
              ร่วมมือกับทางราชการ สันนิบาตสหกรณ์แห่งประเทศไทย
              ชุมนุมสหกรณ์และสหกรณ์อื่น เพื่อส่งเสริมและปรับปรุงกิจการของสหกรณ์
            </li>
            <li>
              กระทำการต่างๆ ตามที่อนุญาตไว้ในกฎหมายว่าด้วยสหกรณ์
              เพื่อให้เป็นไปตามวัตถุประสงค์ที่กล่าวข้างต้น รวมถึง ซื้อ
              ถือกรรมสิทธิ์หรือทรัพยสิทธิครอบครอง กู้ ยืม เช่าหรือให้เช่า
              เช่าซื้อหรือให้เช่าซื้อ โอนหรือรับโอน
              สิทธิการเช่าหรือสทธิการเช่าซื้อ ขายหรือจำหน่าย จำนองหรือรับจำนอง
              จำนำหรือรับจำนำ ด้วยวิธีอื่นใด ซึ่งทรัพย์สินแก่สมาชิกหรือของสมาชิก
            </li>
            <li>ให้ความช่วยเหลือทางวิชาการแก่สมาชิก</li>
            <li>
              ขอหรือรับความช่วยเหลือทางวิชาการจากทางราชการ หน่วยงานของต่างประเทศ
              หรือบุคคลอื่นใด
            </li>
            <li>
              ดำเนินกิจการอย่างอื่นบรรดาที่เกี่ยวกับหรือเนื่องในการจัดให้สำเร็จตามวัตถุประสงค์ของสหกรณ์
            </li>
          </ul>
        </div>
      </div>
    </div>
  );
}
