import HeaderLogo from "@/components/header/HeaderLogo";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "คำเตือนสำหรับผู้ค้ำประกัน",
};

export default function page() {
  return (
    <div className="flex flex-col justify-center items-center gap-5">
      <HeaderLogo />
      <div className="header text-center space-y-1">
        <h5 className="text-xl font-bold">คำเตือนสำหรับผู้ค้ำประกัน</h5>
        <p>ผู้ค้ำประกันจะมีความรับผิดต่อผู้ให้กู้ในสาระสำคัญ ดังนี้</p>
      </div>
      <div className="content w-full pl-7">
        <ul className="list-decimal leading-loose ">
          <li>
            ผู้ค้ำประกันจะต้องรับผิดอย่างจำกัดไม่เกินวงเงินตามที่กำหนดในสัญญากู้ยืมเงิน
          </li>
          <li>
            ผู้ค้ำประกันจะรับผิดต่อผู้ให้กู้ภายในวงเงินที่ผู้กู้ค้างชำระกับผู้ให้กู้ตามสัญญากู้ยืมเงินและอาจต้องรับผิดชดใช้ดอกเบี้ยหรือค่าสินไหมทดแทนอื่นๆ
            อีกด้วย
          </li>
          <li>ผู้ค้ำประกันต้องรับผิดร่วมกับผู้กู้</li>
          <li>
            เมื่อผู้กู้ผิดนัดชำระหนี้
            ผู้ให้กู้มีสิทธิเรียกร้องและบังคับให้ผู้ค้ำประกันชำระหนี้ทั้งหมดที่ผู้กู้ค้างชำระโดยผู้ให้กู้ไม่จำเป็นต้องเรียกร้องหรือบังคับเอาจากผู้กู้ก่อน
          </li>
          <li>
            ผู้ค้ำประกันไม่หลุดพ้นจากความรับผิดแม้ผู้ให้กู้ยอมผ่อนเวลาให้แก่ผู้กู้
          </li>
          <li>
            กรณีผู้กู้เสียชีวิต สหกรณ์ ฯ
            ไม่สามารถหักเงินบำเหน็จตกทอดมาชำระหนี้ได้
            ถ้าผู้มีสิทธิรับเงินไม่ยินยอม ผู้ค้ำประกันต้องรับสภาพหนี้แทนทั้งหมด
          </li>
        </ul>
      </div>
    </div>
  );
}
