import TextTableRedLg from "@/components/ui/TextTableRedLg";
import { ContentProps } from "@/utils/types";

export const specialSavingsContent: ContentProps[] = [
  {
    title: "อัตราดอกเบี้ยต่อปี",
    value: <TextTableRedLg>1.5%</TextTableRedLg>,
  },
  {
    title: "เงื่อนไขการเปิดบัญชี",
    value: [
      <>
        เปิดบัญชีจำนวนเงินขั้นต่ำ <TextTableRedLg>1,000</TextTableRedLg> บาท
      </>,
      <>
        เปิดบัญชีได้ <TextTableRedLg>5</TextTableRedLg> บัญชี/คน
      </>,
    ],
  },
  {
    title: "เงื่อนไขการฝากเงิน",
    value: [
      <>
        ฝากเงินขั้นต่ำครั้งละ <TextTableRedLg>300</TextTableRedLg> บาท
      </>,
      "ฝากเงินได้ไม่จำกัดจำนวนครั้ง",
      <>
        ฝากเงินได้สูงสุด <TextTableRedLg>10,000</TextTableRedLg> บาท/เดือน/คน
        (ฝากรวมทุกเล่ม เฉพาะเล่มสีน้ำเงิน) โดยไม่รวมกรณีโอนภายในบัญชีตัวเอง
      </>,
    ],
  },
  {
    title: "เงื่อนไขการถอนเงิน",
    value: [
      <>
        สมาชิก <TextTableRedLg>1</TextTableRedLg> คน ถอนได้ไม่เกิน{" "}
        <TextTableRedLg>2</TextTableRedLg> ครั้งต่อเดือน โดยไม่คิดค่าปรับ
      </>,
      <>
        ถอนมากกว่า <TextTableRedLg>2</TextTableRedLg> ครั้ง
        คิดค่าปรับการถอนครั้งที่ <TextTableRedLg>3</TextTableRedLg>{" "}
        และครั้งต่อไป ในอัตรา <TextTableRedLg>1%</TextTableRedLg>{" "}
        ของจำนวนเงินที่ถอน โดยคิดค่าธรรมเนียมขั้นต่ำ{" "}
        <TextTableRedLg>300 </TextTableRedLg>บาท
      </>,
      <>
        เงินในบัญชีคงเหลือต้องไม่น้อยกว่า <TextTableRedLg>300</TextTableRedLg>{" "}
        บาท
      </>,
    ],
  },
  {
    title: "เงื่อนไขเกี่ยวกับสมุดคู่บัญชี",
    value: [
      "สหกรณ์จะออกสมุดคู่บัญชีเงินฝากออมทรัพย์พิเศษให้ โดยไม่คิดค่าธรรมเนียม",
      "สมุดคู่บัญชีที่บันทึกรายการเต็มแล้ว ให้ส่งมอบให้แก่สหกรณ์ เพื่อออกสมุดคู่บัญชีเล่มใหม่ให้ โดยไม่คิดค่าธรรมเนียม",
      <>
        สมุดคู่บัญชีหาย สหกรณ์จะออกสมุดคู่บัญชีเล่มใหม่ให้
        โดยคิดค่าธรรมเนียมเล่มละ <TextTableRedLg>30</TextTableRedLg> บาท
      </>,
      "หากพบรายการในสมุดคู่บัญชีคลาดเคลื่อนต้องแจ้งสหกรณ์แก้ไขทันที",
    ],
  },
  {
    title: "เงื่อนไขเกี่ยวกับการคิดดอกเบี้ย",
    value: [
      "คิดดอกเบี้ยให้เป็นรายวันตามจำนวนต้นเงินฝากคงเหลือ",
      <>
        สหกรณ์จะคิดดอกเบี้ยทบเป็นเงินต้นเข้าบัญชีให้ทุกวันที่{" "}
        <TextTableRedLg>30</TextTableRedLg> กันยายนของทุกปี
      </>,
      <>
        จำนวนเงินคงเหลือตํ่ากว่า <TextTableRedLg>1,000</TextTableRedLg> บาท
        สหกรณ์จะไม่คิดดอกเบี้ยให้
      </>,
    ],
  },
  {
    title: "เงื่อนไขการปิดบัญชี",
    value: [
      <>
        คิดดอกเบี้ยให้ถึงวันก่อนวันถอนปิดบัญชี{" "}
        <TextTableRedLg>1</TextTableRedLg> วัน
      </>,
      <>
        หากคณะกรรมการดำเนินการพิจารณาเห็นว่า ผู้ฝากเงินรายใดฝ่าฝืนระเบียบ
        หรือก่อความยุ่งยากให้แก่สหกรณ์ หรือเห็นว่ามีเหตุอันสมควรที่จะปิดบัญชี
        สหกรณ์อาจไม่รับเงินฝากออมทรัพย์พิเศษของผู้ฝากรายนั้นอีก
        หรือจะปิดบัญชีพร้อมกับคิดดอกเบี้ย ให้ถึงก่อนวันปิดบัญชี{" "}
        <TextTableRedLg>1</TextTableRedLg> วันก็ได้
      </>,
      "หากผู้ฝากเงินเสียชีวิต สหกรณ์จะจ่ายคืนเงินฝากคงเหลือทั้งหมดในบัญชีให้แก่ผู้รับผลประโยชน์ (ในกรณีสมาชิกไม่ได้ทำหนังสือตั้งผู้รับผลประโยชน์ สหกรณ์จะจ่ายเงินทั้งหมดให้แก่ผู้รับมรดก หรือผู้จัดการมรดก หรือทายาท หลังจากสหกรณ์เห็นสมควรในการพิจารณาหลักฐานแสดงสิทธิ์แล้ว)",
      "หากสมาชิกลาออกจากสหกรณ์ ฯ ต้องทำการปิดบัญชีเงินฝาก",
    ],
  },
];

export const collateralContent: ContentProps[] = [
  {
    title: "อัตราดอกเบี้ยต่อปี",
    value: <TextTableRedLg>1.5%</TextTableRedLg>,
  },
  {
    title: "เงื่อนไขการเปิดบัญชี",
    value: "เปิดบัญชีเพื่อใช้เป็นหลักประกันสำหรับเงินกู้สามัญเท่านั้น",
  },
  {
    title: "เงื่อนไขการฝากเงิน",
    value:
      "ฝากเพิ่มได้ตามจำนวนส่วนต่างที่ต้องการนำไปเพิ่มเป็นหลักประกันเงินกู้สามัญ",
  },
  {
    title: "เงื่อนไขการถอนเงิน",
    value:
      "ไม่สามารถถอนได้ จนกว่าจะชำระปิดหนี้เงินกู้สามัญที่ใช้เงินฝากค้ำประกัน",
  },
  {
    title: "เงื่อนไขเกี่ยวกับสมุดคู่บัญชี",
    value: [
      "สหกรณ์จะออกสมุดคู่บัญชีเงินฝากออมทรัพย์พิเศษให้ โดยไม่คิดค่าธรรมเนียม",
      "สมุดคู่บัญชีที่บันทึกรายการเต็มแล้ว ให้ส่งมอบให้แก่สหกรณ์ เพื่อออกสมุดคู่บัญชีเล่มใหม่ให้ โดยไม่คิดค่าธรรมเนียม",
      <>
        สมุดคู่บัญชีหาย สหกรณ์จะออกสมุดคู่บัญชีเล่มใหม่ให้
        โดยคิดค่าธรรมเนียมเล่มละ <TextTableRedLg>30</TextTableRedLg> บาท
      </>,
      "หากพบรายการในสมุดคู่บัญชีคลาดเคลื่อนต้องแจ้งสหกรณ์แก้ไขทันที",
    ],
  },
  {
    title: "เงื่อนไขเกี่ยวกับการคิดดอกเบี้ย",
    value: [
      "คิดดอกเบี้ยให้เป็นรายวันตามจำนวนต้นเงินฝากคงเหลือ",
      <>
        สหกรณ์จะคิดดอกเบี้ยทบเป็นเงินต้นเข้าบัญชีให้ทุกวันที่{" "}
        <TextTableRedLg>30</TextTableRedLg> กันยายนของทุกปี
      </>,
      <>
        จำนวนเงินคงเหลือต่ำกว่า <TextTableRedLg>1,000</TextTableRedLg> บาท
        สหกรณ์จะไม่คิดดอกเบี้ยให้
      </>,
    ],
  },
  {
    title: "เงื่อนไขการปิดบัญชี",
    value: "ต้องปิดบัญชีเมื่อหมดหนี้เงินกู้สามัญที่ใช้เงินฝากนี้ค้ำประกัน",
  },
];

export const newYear05Content: ContentProps[] = [
  {
    title: "ระยะเวลาเปิดรับฝาก",
    value: (
      <>
        <TextTableRedLg>1 </TextTableRedLg>มีนาคม -{" "}
        <TextTableRedLg>30</TextTableRedLg> มีนาคม{" "}
        <TextTableRedLg>2566</TextTableRedLg>
      </>
    ),
  },
  {
    title: "อัตราดอกเบี้ยต่อปี",
    value: <TextTableRedLg>2.5%</TextTableRedLg>,
  },
  {
    title: "เงื่อนไขการเปิดบัญชี",
    value: (
      <>
        เปิดบัญชีด้วยจำนวนเงิน <TextTableRedLg>10,000</TextTableRedLg> -{" "}
        <TextTableRedLg>5,000,000</TextTableRedLg> บาท
      </>
    ),
  },
  {
    title: "เงื่อนไขการฝากเงิน",
    value: [
      <>
        ฝากเพิ่มได้ด้วยจำนวนเงิน <TextTableRedLg>10,000</TextTableRedLg> -{" "}
        <TextTableRedLg>5,000,000</TextTableRedLg> บาทต่อครั้ง
      </>,
      <>
        ฝากด้วยเงินสดหน้าเคาน์เตอร์สหกรณ์ ได้ไม่เกิน{" "}
        <TextTableRedLg>100,000</TextTableRedLg> บาท ต่อคน ต่อวัน
      </>,
      <>
        ฝากด้วยการโอนเงินผ่านธนาคารกรุงไทย ก่อนเวลา{" "}
        <TextTableRedLg>13.00</TextTableRedLg> น. ของทุกวันทำการ (หลังจาก{" "}
        <TextTableRedLg>13.00</TextTableRedLg> น.
        สหกรณ์จะนำเงินฝากเข้าบัญชีในวันทำการถัดไป)
      </>,
      <>
        สามารถถอนเงินจากบัญชีออมทรัพย์พิเศษของสมาชิก
        เพื่อนำมาฝากเข้าบัญชีเงินฝากออมทรัพย์พิเศษปีใหม่ ระยะเวลา 60 เดือน
        นี้ได้
      </>,
    ],
  },
  {
    title: "เงื่อนไขการถอนเงิน",
    value: (
      <>
        ห้ามถอนเงิน จนกว่าจะครบระยะเวลา <TextTableRedLg>60</TextTableRedLg>{" "}
        เดือน
      </>
    ),
  },
  {
    title: "เงื่อนไขการคิดดอกเบี้ย",
    value: [
      <>
        จ่ายดอกเบี้ยทุกเดือนเข้าบัญชีธนาคารกรุงไทยของสมาชิก จนครบระยะเวลา{" "}
        <TextTableRedLg>60</TextTableRedLg> เดือน นับตั้งแต่วันที่เปิดบัญชี
        (ครบกำหนดแบบวันชนวัน)
      </>,
      "คำนวณดอกเบี้ยให้ในวันทำการถัดไปของวันรับฝากเงิน",
    ],
  },
  {
    title: "เงื่อนไขการปิดบัญชี",
    value: [
      "เมื่อครบกำหนดสหกรณ์จะโอนต้นเงินฝาก พร้อมดอกเบี้ยเดือนสุดท้าย เข้าบัญชีธนาคารกรุงไทยของสมาชิก",
      <>
        ห้ามปิดบัญชี จนกว่าจะครบระยะเวลา <TextTableRedLg>60</TextTableRedLg>{" "}
        เดือน
      </>,
      <>
        กรณีผู้ฝากปิดบัญชีก่อนระยะเวลา <TextTableRedLg>60</TextTableRedLg> เดือน
        สหกรณ์จะเรียกคืนดอกเบี้ยที่ได้รับไปแล้วทั้งหมด โดยหักจากต้นเงินฝาก
      </>,
    ],
  },
  {
    title: "เงื่อนไขเพิ่มเติม",
    value: (
      <>
        กรณีผู้ฝากเงินถึงแก่กรรมก่อนครบกำหนดระยะเวลา{" "}
        <TextTableRedLg>60 </TextTableRedLg>เดือน
        <ul className="list-disc pl-5">
          <li>
            สหกรณ์จะจ่ายดอกเบี้ยจนครบระยะเวลา{" "}
            <TextTableRedLg>60 </TextTableRedLg> เดือน
          </li>
          <li>
            เมื่อครบกำหนดสหกรณ์จะจ่ายต้นเงินฝากทั้งหมดให้แก่ผู้รับผลประโยชน์
            (ในกรณีที่สมาชิกไม่ได้ทำหนังสือตั้งผู้รับผลประโยชน์ไว้
            สหกรณ์จะจ่ายเงินดังกล่าวให้แก่ผู้รับมรดก หรือผู้จัดการมรดก
            หรือทายาทของผู้ฝาก
            หลังจากสหกรณ์เห็นสมควรในการพิจารณาหลักฐานแสดงสิทธิ์แล้ว)
          </li>
        </ul>
      </>
    ),
  },
];

export const newYear06Content: ContentProps[] = [
  {
    title: "ระยะเวลาเปิดรับฝาก",
    value: (
      <>
        <TextTableRedLg>2</TextTableRedLg> มกราคม -{" "}
        <TextTableRedLg>30</TextTableRedLg> มกราคม{" "}
        <TextTableRedLg>2567</TextTableRedLg>
      </>
    ),
  },
  {
    title: "อัตราดอกเบี้ยต่อปี",
    value: <TextTableRedLg>2.5%</TextTableRedLg>,
  },
  {
    title: "เงื่อนไขการเปิดบัญชี",
    value: (
      <>
        เปิดบัญชีด้วยจำนวนเงิน <TextTableRedLg>10,000</TextTableRedLg> -{" "}
        <TextTableRedLg>5,000,000</TextTableRedLg> บาท
      </>
    ),
  },
  {
    title: "เงื่อนไขการฝากเงิน",
    value: [
      <>
        ฝากเพิ่มได้ด้วยจำนวนเงิน <TextTableRedLg>10,000</TextTableRedLg> -{" "}
        <TextTableRedLg>5,000,000</TextTableRedLg> บาทต่อครั้ง
      </>,
      <>
        ฝากด้วยเงินสดหน้าเคาน์เตอร์สหกรณ์ ได้ไม่เกิน{" "}
        <TextTableRedLg>100,000</TextTableRedLg> บาท ต่อคน ต่อวัน
      </>,
      <>
        ฝากด้วยการโอนเงินผ่านธนาคารกรุงไทย ก่อนเวลา{" "}
        <TextTableRedLg>13.00</TextTableRedLg> น. ของทุกวันทำการ (หลังจาก{" "}
        <TextTableRedLg>13.00</TextTableRedLg> น.
        สหกรณ์จะนำเงินฝากเข้าบัญชีในวันทำการถัดไป)
      </>,
      <>
        สามารถถอนเงินจากบัญชีออมทรัพย์พิเศษของสมาชิก
        เพื่อนำมาฝากเข้าบัญชีเงินฝากออมทรัพย์พิเศษปีใหม่ 2567 ระยะเวลา 60 เดือน
        นี้ได้
      </>,
    ],
  },
  {
    title: "เงื่อนไขการถอนเงิน",
    value: (
      <>
        ห้ามถอนเงิน จนกว่าจะครบระยะเวลา <TextTableRedLg>60</TextTableRedLg>{" "}
        เดือน
      </>
    ),
  },
  {
    title: "เงื่อนไขการคิดดอกเบี้ย",
    value: [
      <>
        จ่ายดอกเบี้ยทุกเดือนเข้าบัญชีธนาคารกรุงไทยของสมาชิก จนครบระยะเวลา{" "}
        <TextTableRedLg>60</TextTableRedLg> เดือน นับตั้งแต่วันที่เปิดบัญชี
        (ครบกำหนดแบบวันชนวัน)
      </>,
      "คำนวณดอกเบี้ยให้ในวันทำการถัดไปของวันรับฝากเงิน",
    ],
  },
  {
    title: "เงื่อนไขการปิดบัญชี",
    value: [
      "เมื่อครบกำหนดสหกรณ์จะโอนต้นเงินฝาก พร้อมดอกเบี้ยเดือนสุดท้าย เข้าบัญชีธนาคารกรุงไทยของสมาชิก",
      <>
        ห้ามปิดบัญชี จนกว่าจะครบระยะเวลา <TextTableRedLg>60</TextTableRedLg>{" "}
        เดือน
      </>,
      <>
        กรณีผู้ฝากปิดบัญชีก่อนระยะเวลา <TextTableRedLg>60</TextTableRedLg> เดือน
        สหกรณ์จะเรียกคืนดอกเบี้ยที่ได้รับไปแล้วทั้งหมด โดยหักจากต้นเงินฝาก
      </>,
    ],
  },
  {
    title: "เงื่อนไขเพิ่มเติม",
    value: (
      <>
        กรณีผู้ฝากเงินถึงแก่กรรมก่อนครบกำหนดระยะเวลา{" "}
        <TextTableRedLg>60 </TextTableRedLg>เดือน
        <ul className="list-disc pl-5">
          <li>
            สหกรณ์จะจ่ายดอกเบี้ยจนครบระยะเวลา{" "}
            <TextTableRedLg>60 </TextTableRedLg> เดือน
          </li>
          <li>
            เมื่อครบกำหนดสหกรณ์จะจ่ายต้นเงินฝากทั้งหมดให้แก่ผู้รับผลประโยชน์
            (ในกรณีที่สมาชิกไม่ได้ทำหนังสือตั้งผู้รับผลประโยชน์ไว้
            สหกรณ์จะจ่ายเงินดังกล่าวให้แก่ผู้รับมรดก หรือผู้จัดการมรดก
            หรือทายาทของผู้ฝาก
            หลังจากสหกรณ์เห็นสมควรในการพิจารณาหลักฐานแสดงสิทธิ์แล้ว)
          </li>
        </ul>
      </>
    ),
  },
];

export const newYear07Content: ContentProps[] = [
  {
    title: "ระยะเวลาเปิดรับฝาก",
    value: (
      <>
        <TextTableRedLg>1</TextTableRedLg> กรกฎาคม -{" "}
        <TextTableRedLg>29</TextTableRedLg> สิงหาคม{" "}
        <TextTableRedLg>2567</TextTableRedLg>
      </>
    ),
  },
  {
    title: "อัตราดอกเบี้ยต่อปี",
    value: <TextTableRedLg>2.5%</TextTableRedLg>,
  },
  {
    title: "เงื่อนไขการเปิดบัญชี",
    value: (
      <>
        เปิดบัญชีด้วยจำนวนเงิน <TextTableRedLg>100,000</TextTableRedLg> -{" "}
        <TextTableRedLg>5,000,000</TextTableRedLg> บาท
      </>
    ),
  },
  {
    title: "เงื่อนไขการฝากเงิน",
    value: [
      <>
        ฝากเพิ่มได้ด้วยจำนวนเงิน <TextTableRedLg>100,000</TextTableRedLg> -{" "}
        <TextTableRedLg>5,000,000</TextTableRedLg> บาทต่อครั้ง
      </>,
      <>
        ฝากด้วยเงินสดหน้าเคาน์เตอร์สหกรณ์ ได้ไม่เกิน{" "}
        <TextTableRedLg>100,000</TextTableRedLg> บาท ต่อคน ต่อวัน
      </>,
      <>
        ฝากด้วยการโอนเงินผ่านธนาคารกรุงไทย ก่อนเวลา{" "}
        <TextTableRedLg>13.00</TextTableRedLg> น. ของทุกวันทำการ (หลังจาก{" "}
        <TextTableRedLg>13.00</TextTableRedLg> น.
        สหกรณ์จะนำเงินฝากเข้าบัญชีในวันทำการถัดไป)
      </>,
      <>
        สามารถถอนเงินจากบัญชีออมทรัพย์พิเศษของสมาชิก
        เพื่อนำมาฝากเข้าบัญชีเงินฝากออมทรัพย์พิเศษปีใหม่ รุ่นสะสมทรัพย์ ระยะเวลา{" "}
        60 เดือน นี้ได้
      </>,
    ],
  },
  {
    title: "เงื่อนไขการถอนเงิน",
    value: (
      <>
        ห้ามถอนเงิน จนกว่าจะครบระยะเวลา <TextTableRedLg>60 </TextTableRedLg>
        เดือน
      </>
    ),
  },
  {
    title: "เงื่อนไขการคิดดอกเบี้ย",
    value: [
      <>
        จ่ายดอกเบี้ยทุกเดือนเข้าบัญชีธนาคารกรุงไทยของสมาชิก จนครบระยะเวลา{" "}
        <TextTableRedLg>60</TextTableRedLg> เดือน นับตั้งแต่วันที่เปิดบัญชี
        (ครบกำหนดแบบวันชนวัน)
      </>,
      "คำนวณดอกเบี้ยให้ในวันทำการถัดไปของวันรับฝากเงิน",
    ],
  },
  {
    title: "เงื่อนไขการปิดบัญชี",
    value: [
      "เมื่อครบกำหนดสหกรณ์จะโอนต้นเงินฝาก พร้อมดอกเบี้ยเดือนสุดท้าย เข้าบัญชีธนาคารกรุงไทยของสมาชิก",
      <>
        ห้ามปิดบัญชี จนกว่าจะครบระยะเวลา <TextTableRedLg>60</TextTableRedLg>{" "}
        เดือน
      </>,
      <>
        กรณีผู้ฝากปิดบัญชีก่อนระยะเวลา <TextTableRedLg>60</TextTableRedLg> เดือน
        สหกรณ์จะเรียกคืนดอกเบี้ยที่ได้รับไปแล้วทั้งหมด โดยหักจากต้นเงินฝาก
      </>,
    ],
  },
  {
    title: "เงื่อนไขเพิ่มเติม",
    value: (
      <>
        กรณีผู้ฝากเงินถึงแก่กรรมก่อนครบกำหนดระยะเวลา{" "}
        <TextTableRedLg>60 </TextTableRedLg>เดือน
        <ul className="list-disc pl-5">
          <li>
            สหกรณ์จะจ่ายดอกเบี้ยจนครบระยะเวลา{" "}
            <TextTableRedLg>60 </TextTableRedLg> เดือน
          </li>
          <li>
            เมื่อครบกำหนดสหกรณ์จะจ่ายต้นเงินฝากทั้งหมดให้แก่ผู้รับผลประโยชน์
            (ในกรณีที่สมาชิกไม่ได้ทำหนังสือตั้งผู้รับผลประโยชน์ไว้
            สหกรณ์จะจ่ายเงินดังกล่าวให้แก่ผู้รับมรดก หรือผู้จัดการมรดก
            หรือทายาทของผู้ฝาก
            หลังจากสหกรณ์เห็นสมควรในการพิจารณาหลักฐานแสดงสิทธิ์แล้ว)
          </li>
        </ul>
      </>
    ),
  },
];
